import { Fragment } from "react";
import MarbleCard from "../components/UI/MarbleCard";
import styles from "../styles/MarblePage.module.css";

const MarblePage = () => {
  return (
    <Fragment>
      <section>
        <h1>סוג השיש</h1>
        <p>
          .הדבר הראשון שבוחרים כאשר אנו עושים מצבה זה סוג השיש
          <br />
          .לכל סוג שיש יש מראה ייחודי והבדלים באיכות ובמחיר המצבה{" "}
        </p>
      </section>
      <article>
        <h2>:סוגי השיש שלנו</h2>
        <div className={styles.container}>
          <MarbleCard
            link="hevron"
            header="אבן חברון"
            img="hevron-marble.jpg"
            quality="3.5/5"
            price="$"
            p="קרויה גם אבן ירושלים מגיעה מהרי חברון הייחודיות של האבן ויופיה נובע
             מאי אחידותה ומעורקי הצבע העוברים באבן ויוצרים בה ייחודיות אבן נוחה מאוד לליטוש ועיבוד
          חשוב להבין שהחברון היא אבן ולא שיש ולכן היא רגישה יותר לפגעי הזמן וצריכה תחזוקה מדי כמה שנים. מצבה
          מאבן חברון היא המצבה הפשוטה ביותר והזולה ביותר
          אבל לפעמים הכי פשוט זה גם הכי יפה"
          />

          <MarbleCard
            link="turki"
            header="שיש טורקי"
            img="turkish-marble.webp"
            quality="4/5"
            price="$$"
            p="השיש הטורקי מגיע אלינו מטורקיה מכאן שמו שיש בצבע אפור בהיר איכותי עמיד בתנאי מזג האוויר אך איכותו אינה כמו איכות הגרניט תמורה גבוהה ביחס למחיר"
          />

          <MarbleCard
            link="black-granite"
            header="גרניט שחור"
            img="black-marble.jpg"
            quality="5/5"
            price="$$$$"
            p="הגרניט השחור הינו גרניט חזק מאוד אשר שומר על ברק ומראו עשרות שנים התכונה הייחודית שלו הוא שהכיתוב בו יוצא טבעי אפור מחריטה על האבן לכן משתמשים בו לרוב כציפוי למצבה אחרת כדי לקבל אותיות שלא נמחקות בנוסף לשמירה על פני האבן על הגרניט השחור אמן יכול לצייר וניתן לעשות בו תמונות וציורים על גבי האבן"
          />

          <MarbleCard
            link="brown-granite"
            header="גרניט סרדו חום"
            img="brown-marble.jpg"
            quality="4.5/5"
            price="$$$"
            p="גרניט סרדו חום נקרא כך בגלל דמיונו לסרדו האפור גווינו נעים בין חום לורוד כיאה לגרניט הוא חזק ועמיד תכונה נוספת שלו שהוא פחות רגיש לאבק כתמים ונזקי מזג האוויר ושומר על מראו המיוחד עשרות שנים"
          />

          <MarbleCard
            link="gray-granite"
            header="גרניט סרדו אפור"
            img="gray-marble.jpg"
            quality="4.5/5"
            price="$$"
            p="גרניט סרדו אפור במקור יוצר בסרדיניה ועל כן שמו סרדו צבעו אפור בהיר וכיאה לגרניט הוא חזק ועמיד בעל תמורה גבוהה ביחס למחירו הנמוך בהשוואה לסוגי גרניט אחרים "
          />
          <MarbleCard
            link="slaybe"
            header="אבן סלייב"
            img="slaybe-marble.webp"
            quality="3/5"
            price="$$"
            p="אבן הסלייב הינה סוג של אבן חברון הנחצבת בהרי יהודה אשר מופיעה בטבע בגווני כתום ורדרד אבן מיוחדת ביופיה אשר משתלבת בקלות על אבנים טבעיות אך בשונה מהחברן פחות עמידה ונוטה להתפורר לכן מומלצת כגוש ולא אבן מלא תמורה פחות טובה למחיר אך המראה המיוחד שלה הופך כל מצבה למיוחדת במינה"
          />
          <MarbleCard
            link="red-granite"
            header="גרניט אדום"
            img="red-marble.webp"
            quality="5/5"
            price="$$$$"
            p="בדומה לשחור גרניט אדומה היא גרניט חזקה מאוד ונחשבת איכותית מאוד כמו בשחור גם היא משמשת לפעמים ככיסוי למצבה אחרת שכן גם היא לא חייבת צבע על מנת שייראו את האותיות ועל כן הכיתוב איננו נמחק גם על גרניט מסוג זה ניתן לעשות תמונות וציורים"
          />
          <MarbleCard
            link="orez-granite"
            header="גרניט אורז"
            img="orez-marble.webp"
            quality="5/5"
            price="$$$$"
            p=" גרניט אורז הוא כינוייה בקרב בוני המצבות צבעה נע בין אפור בהיר לכהה דומה במראה לסרדו האפור אך נחשב איכותי יותר "
          />
          <MarbleCard
            link="blue-granite"
            header="גרניט רייזן בלו"
            img="blue-marble.jpg"
            quality="5/5"
            price="$$$$"
            p="גרניט מסוג זה מופיע בגוונים של סגול כחלחל ונחשב לאיכותי מאוד בנוסף לצבעו המיוחד מצבה מגרניט זה נחשבת ליוקרתית חזקה ועמידה "
          />
          <MarbleCard
            link="green-granite"
            header="גרניט ירוק"
            img="green-marble.jpg"
            quality="5/5"
            price="$$$$"
            p="חדש! מצבה מגרניט ירוק הינה מצבה מיוחדת ביופיה אשר לא תמצאו אצל כל בונה מצבות גרניט זה מחזיק בכל התכונות שהופכות מצבה ולחזקה ואיכותית בנוסף לצבע המיוחד שלה"
          />
        </div>
      </article>
    </Fragment>
  );
};

export default MarblePage;
